Revit 2027 API
AssetPropertyDoubleArray4d.SetValueAsColor Method
 Sets the value property as a color.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValueAsColor(
	Color color
)
Public Sub SetValueAsColor (
	color As Color
)
public:
void SetValueAsColor(
	Color^ color
)
member SetValueAsColor :
        color : Color -> unit
Parameters
color Color
 The new color.
Exceptions
Exception | Condition
ArgumentException |  The input value is invalid for this AssetPropertyDoubleArray4d property.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace